////////////13/////////////////////////////////////////////////////
////////1////////////////
/*
let df="123";
alert(df);

///////////////////////17/////////////////////////////////////////
////////1////////////////
let y=1+2+3;
alert(y);
*/

///////////////////////22//////////////////////////////////////////
////////1////////////////
let fg= 1.5, k=0.75;
console.log(fg+k);

////////////23/////////////////////////////////////////////////////
////////1////////////////
let jk =-100;
console.log(jk);
////////2////////////////
let kl =-55100;
console.log(-kl);

//////////////////25///////////////////////////////////////////////
////////1////////////////
let ah = 13;
let bh = 5;
console.log(ah%bh);

//////////////////26///////////////////////////////////////////////
////////1////////////////
let al = 2**10
console.log(al);

//////////////////28///////////////////////////////////////////////
////////1////////////////
let ab="Demir";
let aj="Irina";
console.log(ab, "\n", aj);

//////////////////29/////////////////////////////////////////////
////////1////////////////
let fgh='!!!';
console.log(fgh);

///////////2////////////
let fgl='java';
let fgk='script';
console.log(fgl+fgk);

/////////3//////////
let fl='hello';
let fa=' world';
console.log(fl+fa);

//////////////////30///////////////////////////////////////////////
////////1////////////////
let nm="dfghjk";
console.log(nm.length);

//////////////////31///////////////////////////////////////////////
////////1////////////////
let str1 = 'xxx';
let str2 = 'yyy';
let txt  = `aaa${str1}bbb${str2}ccc`;
console.log(txt);

//////////////////32///////////////////////////////////////////////
////////1////////////////
let str76 = `a
b
c`;

//////////////////34///////////////////////////////////////////////
////////1////////////////
/*
let aw;
alert(aw);


//////////////////35///////////////////////////////////////////////
////////1////////////////
let yu = null;
alert(yu);*/

//////////////////36///////////////////////////////////////////////
////////1 and 2////////////////
let str28 = true;
let txt8  = false;
console.log(str28);
console.log(txt8);

//////////////////37//////////////////////////////////////////////
////////1////////////////
let rt="fcdsx";
let as="gfdvfsfdv";
console.log(rt*as);
//////////////////38///////////////////////////////////////////////
////////1////////////////
console.log( 10 / 0); 
console.log(-10 / 0);

//////////////////38///////////////////////////////////////////////
////////////1//////////

console.log(123);
console.log('123');
console.log(true);
console.log(Undefined);
console.log(Null);
console.log(Undefined);
//////////////////№42.//////////////////////////////
const PI=3.14;
let r=34, l;
l=2*PI*r;
console.log(l);

///////////////////№45.///////////////////////////
let a = '2';
let b = '3';
console.log(+a + +b);

///////////////////№48//////////////////////////
let num1 = 165;
let num2 = 265;
console.log(String(num1) + String(num2));

///////////////////№49////////////////////////////
///////1/////////
let num = 1655;
console.log(String(num).length);
//////2//////
let num5 = 165;
let num6 = 265;
console.log((String(num5).length)+(String(num6).length));

///////////////////№52///////////////////////////
///////1//////////
let str = 'abcde';
console.log(str[0]);
console.log(str[2]);
console.log(str[4]);

///////2//////////
let a1, b1, c, d, e, f, stro = 'abcde';
a1=stro[4];
b1=stro[3];
c=stro[2];
e=stro[1];
f=stro[0];
console.log(a1+b1+c+e+f);

///////3/////////
let num65 = 3, strok = 'abcde';
console.log(strok[3]);

///////////////////№54///////////////////////////
///////1////////
let stroka = 'abcdefghijk';
let last = stroka.length - 1;
console.log(stroka[last]);
////////2///////
let stroka1 = 'abcdefghijk';
let last1 = stroka1.length - 2;
console.log(stroka1[last1]);
////////3///////
let stroka2 = 'abcdefghijk';
let last2 = stroka2.length - 3;
console.log(stroka2[last2]);

///////////////////№55////////////////////////////
///////1////////
let test = '12345'; // строка
console.log(Number(test[0]) + Number(test[1])+Number(test[2]) + Number(test[3])+Number(test[4]));

///////////////////№56////////////////////////////
///////1////////
let test2 = String(12345); // строка
console.log(Number(test2[0]) + Number(test2[1]) + Number(test2[2]) + Number(test2[3]) + Number(test2[4]));
///////2////////
let test3 = String(12345); // строка
console.log(Number(test3[0]) * Number(test3[1]) * Number(test3[2]) * Number(test3[3]) * Number(test3[4])); 
///////3////////
/*let test4 = String(12345); // строка
console.log(Number(test4[4]).Number(test4[3]).Number(test4[2]).Number(test4[1]).Number(test4[0])); */
///////////////////№58/////////////////////////////////////
///////1////////
let nume = 47;
nume += 7;
nume -=18;
nume *= 10;
nume /= 15;
console.log(nume);

///////////////////№59/////////////////////////////////////
///////1////////
let numo = 10;
numo++;
numo++;
numo--;
console.log(numo);

///////////////////№62/////////////////////////////////////////
///////1////////
/*let am = prompt('Ваш возраст?');
alert(am);
///////////////////№63//////////////////////////////////////
///////1////////
/*let num3 = prompt('Введите первое число');
let num4 = prompt('Введите второе число');
console.log(Number(num3) + Number(num4)); 

///////2////////
let afd= prompt("Введите сторону квадрата:");
console.log("Площадь данного квадрата:" ,afd**2);*/
///////3////////
/*let af1= prompt("Введите сторону первую прямоугольника:");
let af2= prompt("Введите сторону вторую прямоугольника:");
console.log("Периметр введенного прямоугольника:", ((af1+af2)*2));*/

///////////////////№64//////////////////////////////////////
///////1////////
/*
document.write("hello!");
///////2///////////
document.write(hello<i>hellochello);*/
///////////////////№63//////////////////////////////////////
///////1////////

///////////////////№66//////////////////////////////////////
///////1////////
console.log(24*60*60);
///////2////////
console.log(30*24*60*60);
///////3////////
console.log(365*24*60*60);
///////4////////
console.log(24*60);
///////5////////
console.log(365*24*60);
///////6////////
console.log(1024*1024);
///////7////////
console.log(1024*1024*1024);
///////8////////
console.log(1024*1024*1024*10);
///////9////////
console.log(1024*1024*1024*1024);
///////10////////
console.log(1024*1024*1024);


//////////////////67/////////////////////////////////////
////////1///////////
let r1=25, s;
s=2*PI*r1;
console.log(s)
////////2///////////
let a3=5, s1;
s1=a3**2;
console.log(s1);
////////3///////////
let a4=45, b4=45;
p=(a4*b4);
console.log("Площадь введенного прямоугольника:", p);
////////4///////////
let a5=45, b5=45, s44;
s44=(a5+b5)*2;
console.log("Периметр введенного прямоугольника:", s44);
////////5///////////
let tc=89;
console.log((9/5)*tc+32);
////////6///////////
let tf=89;
console.log((5/9)*(tf-32));


//////////////////68/////////////////////////////////////
////////1///////////
/*let arr=[45, 54, 5454];
alert(arr)
console.log(arr)*/
////////2///////////
/*let arr=["gfgf", "gf", "54"];
alert(arr)
console.log(arr)*/


//////////////////69/////////////////////////////////////
////////1///////////
let arr=[1, 2, 3];
console.log(arr[0], arr[1], arr[2])
////////2///////////
let arr1=[1, 2, 3];
console.log(arr1[0]+arr1[1]+arr1[2])
/////////3//////
let arr2 = ['a', 'b', 'c', 'd'];
console.log(arr2[0], "+", arr2[1], "+", arr2[2])


//////////////////70/////////////////////////////////////
////////1///////////
let arr3=[45, 54, 5454, "ghfgf", "gfggd"];
console.log(arr3.length)
////////2///////////
let arr4=[45, 54, 5454, "ghfgf", "gfggd"];
console.log(arr4[arr4.length-1])


////////////71////////////////////////////////////////
////////1////////////////
let arr5 = ['a', 'b', 'c'];
arr5[0]=1;
arr5[1]=2;
arr5[2]=3;
console.log(arr5);


////////////72////////////////////////////////////////
////////1////////////////

let arr6=[2, 5, 7]
arr6[0]= arr6[0]+"3";
arr6[1]= arr6[1]+"3";
arr6[2]= arr6[2]+"3";
console.log(arr6);


////////////73////////////////////////////////////////
////////1////////////////
let arr7=[2, 5, 7]
arr7[0]++;
arr7[1]++;
arr7[2]++;
console.log(arr7);


////////////74/////////////////////////////////////
////////1////////////////
let arr8 = [];
arr8[0] = '1';
arr8[1] = '2';
arr8[2] = '3';
console.log(arr8)
//////////2////////
let arr9 = [1, 2, 3];
arr9[4] = 5;
arr9[3] = 4;
console.log(arr9)


////////////75///////////////
////////1////////////////
let arr10 = [];
arr10[3] = 'a';
arr10[8] = 'b';
console.log(arr10.length)


////////////76///////////////////////////////
////////1////////////////
let arr11 = [];
arr.push('1');
arr.push('2');
arr.push('3');

///////2////////
let arr12 = [1, 2, 3];
arr.push('4');
arr.push('5');

////////////77////////////////////////////////////////
////////1////////////////
let arr13 = ['a', 'b', 'c'];
let key = 2;
console.log(arr13[key]);
////////2/////
let arr14 = [1, 2, 3, 4, 5];
let key1 = 1;
let key2 = 2;
console.log(arr14[key1]+arr14[key2]);


////////////78//////////////////////////////
////////1////////////////
let arr15 = ['a', 'b', 'c', 'd', 'e'];
delete arr15[0];
delete arr15[1];
console.log(arr15.length);


////////////80/////////////////////////////////
////////1////////////////
let obj={1:"Понедельник", 2:"Вторник", 3:"Среда", 4:"Четверг", 5:"Пятница", 6:"Суббота", 7: "Воскресенье"};
console.log(obj);

////////////81///////////////////////////////////////
////////1////////////////
let obje={1:"январь", 2:"февраль", 3:"март", 4:"апрель", 5:"май", 6:"июнь", 7: "июль", 8: "август", 9: "сентябрь", 10: "октябрь", 11: "ноябрь", 12: "декабрь"};
console.log(obje);

////////////82////////////////////////////////////////////
////////1////////////////

let objec={name:"Irina", surname:"Demir", patronymic:"Leonidovna"};
console.log(objec);

////////////83//////////////////////////////////
////////1////////////////;
let object={year: 2024, month: 01, day: 17}
console.log(object);

////////////85////////////////////////////////////
////////1////////////////
let obj1 = {x: 1, y: 2, z: 3};
obj1["x"] = 1*1;
obj1["y"] = 2**2;
obj1["z"] = 3**3;
console.log(obj1);

////////////86//////////////////////////////////
////////1////////////////
let obj2={};
obj2.c=2;
obj2.g="rgt";
obj2.j=56;
console.log(obj2);

////////////87/////////////////////////////////////////////////////
////////1////////////////
let obj3 = {3: 'c', 1: 'a', 2: 'b'};
console.log(obj3[1]);
console.log(obj3[2]); 
console.log(obj3[3]); 

////////////88/////////////////////////////////////////////////
////////1////////////////
let obj4 = {x: 1, y: 2, z: 3};
let keys = Object.keys(obj4);
console.log(keys);

////////////89/////////////////////////////////////////////
////////1////////////////
let obj5 = {x: 1, y: 2, z: 3};
console.log(Object.keys(obj5).length);

////////////90/////////////////////////////////////////////////
////////1////////////////
let obj6 = {x: 1, y: 2, z: 3};
let gh="x";
console.log(obj6[gh]);

////////////91/////////////////////////////////////////////////////
////////1////////////////
let obj7 = {x: 1, y: 2, z: 3};
console.log(obj7["x"]);
/////////2///////////
let obj8 = {x: 1, y: 2, z: 3};
let key4 = 'x';
console.log(obj8[key4]);

////////////92/////////////////////////////////////////////////////
////////1////////////////
let obj11 = {x: 1, y: 2, z: 3};
let prop = 'x';
console.log(obj11[prop]);
/////////2/////////////
let obj24 = {x: 1, y: 2, z: 3};
let prop1 = 'x';
console.log(obj24[prop1]);
/*
////////////93/////////////////////////////////////////////////////
////////1////////////////
let key11 = 'x';
let obj25 = {
	[key11]: 1,
	y: 2,
	z: 3
};
////////2/////////////
let obj35 = {
	[key15]: 1,
	[key25]: 2,
	[key35]: 3
};
let key15 = 'x';
let key25 = 'y';
let key35 = 'z';
*/
////////////103/////////////////////////////////////////////////////
////////1////////////////
let obj34 = {x: 1, y: 2, z: 3};
console.log(obj34.x);
/////////2///////////
let obj67 = {x: 1, y: 2, z: 3};
let key6 = 'x';
console.log(obj67[key6]);

///////////////3////////
let obj88 = {x: 1, y: 2, z: 3};
let sum = obj88["x"] + obj88["y"] + obj88["x"];
console.log(sum);

////////////4/////////
let obj89 = {x: 1, y: 2, z: 3};
let h=Object.keys(obj89);
console.log(h.length);